//* Задача 1:
//*  Напишите программу, которая принимает
//* на вход число и проверяет, кратно ли оно одновременно 7 и 23
//? Пример:
//? a=50 => нет
//? a=7 => нет
//? a=322 => да


// Console.WriteLine("введите число");
// int num1 = Convert.ToInt32(Console.ReadLine());

// if(num1 % 7 == 0 && num1 % 23 == 0)
// {
//     Console.WriteLine("да");
// }
// else
// {
//     Console.WriteLine("Нет");
// }