//* Задача 4: 
//* Напишите программу, которая на вход
//* принимает натуральное число N, а на выходе
//* показывает его цифры через запятую.
//? Пример:
//? 568 => 5,6,8
//? 8 => 8
//? 9542 => 9,5,4,2

// Console.WriteLine("Введите натуральное число");
// string N = Console.ReadLine()!;  //* sting N = тип возращающемого действия
// for (int i = 0; i < N.Length; i++) //* N.Length - функция которая автоматически считывает элементы ( число i = 0; i <  )
// {
//     Console.Write(N[i]);  //*  
//     if (i != N.Length - 1)
//     {
//         Console.Write(",");
//     }
// }