//* Задача 2: 
//* Напишите программу, которая принимает
//* на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠
//* 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.
//? Пример:
//? 2, 3 => 1
//? -5, 3 => 2
//? -3, -2 => 3
//? 4, -2 => 4

// Console.WriteLine("Введите число");
// int X = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число");
// int Y = Convert.ToInt32(Console.ReadLine());

// if (X > 0 && Y > 0)
// {
//     Console.WriteLine("1 четверть");
// }
// else if (X < 0 && Y > 0)
// {
//     Console.WriteLine("2 Четверть");
// }
// else if (X < 0 && Y < 0)
// {
//     Console.WriteLine("3 четверть");
// }
// else if ( X > 0 && Y < 0)
// {
//     Console.WriteLine("4 четверть");
// }