// * 3 Задача.
// * Напишите программу, которая принимает на вход
// * трёхзначное целое число и на выходе показывает сумму
// * первой и последней цифры этого числа.
// ? 456 => 10
// ? 782 => 9
// ? 918 => 17

// Console.WriteLine("Введите трехзначное число");
// int num = Convert.ToInt32(Console.ReadLine());

// int num1= num/100;
// int num2 = num % 10;

// int result = num1 + num2;
// Console.WriteLine(result);
