//* Задача 3: 
//* Напишите программу, которая принимает
//* на вход целое число из отрезка [10, 99] и показывает
//* наибольшую цифру числа.
//? Пример:
//? 40 => 4
//? 96 => 9
//? 72 => 7

// Console.WriteLine("Введите двухзначное число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num >= 10 && num < 100)
// {
//     int num1 = num % 100 / 10;
//     int num2 = num % 10;
//     Console.WriteLine(Math.Max(num1,num2));
// }
// else if (num < 10 || num > 100)
// {
//     Console.WriteLine("Введенное число не двухзначное");
// }